pegasus/test/wetest/wsman/EnumerateAssociation/EnumerateAssociation_Success02.xml

<env:Envelope 
xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" 
xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" 
xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer"
xmlns:wsmb="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd">
    <env:Header>
        <wsa:To>http://localhost/wsman</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</wsa:Action>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:MessageID>uuid:c612ca35-cbb0-4ec5-9fad-8ce126f057c8</wsa:MessageID>
        <wsman:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/*</wsman:ResourceURI>
    </env:Header>
    <env:Body>
        <wsen:Enumerate>
            <wsman:EnumerationMode>EnumerateEPR</wsman:EnumerationMode>
            <wsman:MaxElements>20</wsman:MaxElements>
            <wsman:OptimizeEnumeration></wsman:OptimizeEnumeration>
            <wsman:Filter Dialect="http://schemas.dmtf.org/wbem/wsman/1/cimbinding/associationFilter">
                <wsmb:AssociatedInstances>
                    <wsmb:Object>
                        <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
                        <wsa:ReferenceParameters>
                            <wsman:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/WsmBase</wsman:ResourceURI>
                            <wsman:SelectorSet>
                                <wsman:Selector Name="__cimnamespace">test/WsmTest</wsman:Selector>
                                <wsman:Selector Name="keyProperty">key1</wsman:Selector>
                            </wsman:SelectorSet>
                        </wsa:ReferenceParameters>
                    </wsmb:Object>
                </wsmb:AssociatedInstances>
            </wsman:Filter>
        </wsen:Enumerate>
    </env:Body>
</env:Envelope>
